acpi
aic94xx-firmware
ast-firmware
base
base-devel
bash-completion
bat
batsignal
calc
cbonsai
cliphist
cmatrix-git
code
composer
cpio
cups
cups-pdf
cups-pk-helper
customtkinter
discord
displaylink
docker
docker-compose
dosfstools
dunst
efibootmgr
entr
evdi-git
fake-ms-fonts
fastfetch
fd
feh
firefox
font-manager
ghcup-hs-bin
git
github-cli
glow
gnome-themes-extra
go
gparted
grub
grub-customizer
gtk-engine-murrine
htop-vim
hypridle
hyprland
hyprlock-git
hyprpaper
hyprpicker
hyprshot
i3-wm
i3lock-color
i3status
imagemagick
inetutils
intel-media-driver
intel-ucode
inxi
jdk-openjdk
kitty
lazygit
lf
linux
linux-firmware
linux-firmware-qlogic
linux-headers
linux-lts
lsof
lxappearance
ly
maim
mattermost
mercury-browser-bin
mesa
micro
neofetch
neovim
network-manager-applet
networkmanager
nm-connection-editor
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-emoji-blob
noto-fonts-extra
npm
obsidian-bin
openvpn
os-prober
pacman-contrib
parted
paru-bin
pcmanfm
pdfjs
php
picom
pipewire-pulse
polkit-kde-agent
polybar
poppler-glib
python-dbus-fast
python-dbus-next
python-i3ipc
python-ipykernel
python-pip
python-poetry
python-pulsectl-asyncio
qtile
qutebrowser
reflector
remind
resources
ripgrep
rofi
rofi-greenclip
rsync
ruby
sl
smartmontools
socat
spotify-launcher
sudo
sweet-gtk-theme-dark
system-config-printer
tcllib
terminator
texlive-basic
texlive-binextra
texlive-fontsextra
texlive-fontsrecommended
texlive-langchinese
texlive-langspanish
texlive-latex
texlive-latexextra
texlive-latexrecommended
texlive-luatex
texlive-xetex
timg-git
tlp
tlpui
tmux
tmux-plugin-manager
ttf-fira-code
ttf-fira-mono
ttf-fira-sans
ttf-firacode-nerd
ttf-font-awesome
ttf-jetbrains-mono
ttf-jetbrains-mono-nerd
unzip
upd72020x-fw
update-grub
vi
vim
vulkan-intel
waybar
wd719x-firmware
wlr-randr
xclip
xcolor
xcursor-arch-cursor-complete
xcursor-viewer-git
xdg-desktop-portal-hyprland
xdotool
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-encodings
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xclipboard
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmodmap
xorg-xpr
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwd
xorg-xwininfo
xorg-xwud
xsel
xss-lock
zathura
zathura-pdf-mupdf
zsh
zsh-theme-powerlevel10k-git
zsh-vi-mode-git
