7zip
acpi
aic94xx-firmware
appmenu-gtk-module
ast-firmware
atuin
base
base-devel
bash-completion
bat
batsignal
biber
bind
blueman
bluez
bluez-utils
brightnessctl
calc
cbonsai
clang
cliphist
cmake
cmatrix-git
code
cups
cups-pdf
cups-pk-helper
customtkinter
discord
diskus
docker
docker-buildx
docker-compose
dosfstools
dunst
dust
efibootmgr
entr
ex-vi-compat
extra-cmake-modules
fake-ms-fonts
fastfetch
fd
feh
firefox
firejail
font-manager
fzf
gdu
ghcup-hs-bin
git
git-lfs
github-cli
glad
glfw
glm
go
gparted
grimblast-git
grub
grub-customizer
gtk-engine-murrine
hdf5
hplip
htop-vim
hugo
hypridle
hyprland
hyprlock
hyprpaper
hyprpicker
hyprsunset
hyprwayland-scanner
i3-wm
i3lock-color
i3status
imagemagick
inetutils
inkscape
intel-media-driver
intel-ucode
inxi
jdk21-openjdk
jq
keybase-bin
kitty
kvantum
lazygit
ldns
linux
linux-firmware
linux-firmware-qlogic
linux-headers
linux-lts
linux-lts-headers
lsd
lsof
lua-inspect
lxappearance
lxqt-config
ly
maim
mdcat
memtest86+-efi
mesa
mesa-utils
micro
neofetch
neovim
neovim-telescope-fzf-native-git
network-manager-applet
networkmanager
nginx
nm-connection-editor
nodejs-neovim
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-emoji-blob
noto-fonts-extra
npm
nss-mdns
obs-studio
opencv
openvpn
os-prober
otf-font-awesome
pacman-contrib
parted
paru
paru-debug
pcmanfm
pdfjs
picom
pipewire-libcamera
pipewire-pulse
pixi
pnpm
polkit-kde-agent
polybar
poppler-glib
postgresql
pyenv
python-dbus-fast
python-dbus-next
python-i3ipc
python-nptyping
python-numpy
python-pip
python-pipenv
python-poetry
python-pulsectl-asyncio
python-pynvim
redis
reflector
remind
renderdoc
resources
ripgrep
rofi-greenclip
rofi-lbonn-wayland
rsync
ruby
rustup
shaderc
sl
smartmontools
socat
spotify-launcher
sshpass
stylua
sudo
swaylock-effects
sweet-gtk-theme-dark
sweet-kde-git
system-config-printer
tailwindcss-language-server
tcllib
terminator
texlive-basic
texlive-binextra
texlive-fontsextra
texlive-fontsrecommended
texlive-langchinese
texlive-langspanish
texlive-latex
texlive-latexextra
texlive-latexrecommended
texlive-luatex
texlive-mathscience
texlive-xetex
the_silver_searcher
tlp
tlpui
tmux
tmux-plugin-manager
traceroute
tree
ttf-comic-sans
ttf-fira-code
ttf-fira-mono
ttf-fira-sans
ttf-firacode-nerd
ttf-jetbrains-mono
ttf-jetbrains-mono-nerd
typst
ufw
unzip
upd72020x-fw
update-grub
uv
vagrant
virtualbox
virtualbox-host-dkms
vlc
vlc-plugin-ffmpeg
vtk
vulkan-extra-layers
vulkan-extra-tools
vulkan-html-docs
vulkan-intel
vulkan-tools
vulkan-utility-libraries
waybar
wd719x-firmware
wev
wireguard-tools
wlr-randr
xclip
xcolor
xcursor-arch-cursor-complete
xcursor-viewer-git
xdg-desktop-portal-gtk
xdg-desktop-portal-hyprland
xdg-user-dirs
xdotool
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-encodings
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xclipboard
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmodmap
xorg-xpr
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwd
xorg-xwininfo
xorg-xwud
xsel
xss-lock
xwaylandvideobridge
yubico-authenticator-bin
zathura
zathura-pdf-mupdf
zed
zoxide
zsh
zsh-theme-powerlevel10k-git
zsh-vi-mode-git
